Ran Plan for dir: `podinfo` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # helm_release.podinfo will be created
+ resource "helm_release" "podinfo" {
      + atomic                     = false
      + chart                      = "podinfo"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "podinfo"
      + namespace                  = "podinfo"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://stefanprodan.github.io/podinfo"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                # Default values for podinfo.
                
                replicaCount: 1
                logLevel: info
                host: #0.0.0.0
                backend: #http://backend-podinfo:9898/echo
                backends: []
                
                image:
                  repository: ghcr.io/stefanprodan/podinfo
                  tag: 6.1.4
                  pullPolicy: IfNotPresent
                
                ui:
                  color: "#34577c"
                  message: ""
                  logo: ""
                
                # failure conditions
                faults:
                  delay: false
                  error: false
                  unhealthy: false
                  unready: false
                  testFail: false
                  testTimeout: false
                
                # Kubernetes Service settings
                service:
                  enabled: true
                  annotations: {}
                  type: ClusterIP
                  metricsPort: 9797
                  httpPort: 9898
                  externalPort: 9898
                  grpcPort: 9999
                  grpcService: podinfo
                  nodePort: 31198
                  # the port used to bind the http port to the host
                  # NOTE: requires privileged container with NET_BIND_SERVICE capability -- this is useful for testing
                  # in local clusters such as kind without port forwarding
                  hostPort:
                
                # enable h2c protocol (non-TLS version of HTTP/2)
                h2c:
                  enabled: false
                
                # enable tls on the podinfo service
                tls:
                  enabled: false
                  # the name of the secret used to mount the certificate key pair
                  secretName: "podinfo-tls"
                  # the path where the certificate key pair will be mounted
                  certPath: /data/cert
                  # the port used to host the tls endpoint on the service
                  port: 9899
                  # the port used to bind the tls port to the host
                  # NOTE: requires privileged container with NET_BIND_SERVICE capability -- this is useful for testing
                  # in local clusters such as kind without port forwarding
                  hostPort:
                
                # create a certificate manager certificate (cert-manager required)
                certificate:
                  create: false
                  # the issuer used to issue the certificate
                  issuerRef:
                    kind: ClusterIssuer
                    name: self-signed
                  # the hostname / subject alternative names for the certificate
                  dnsNames:
                    - podinfo.amaraldavi.com.br
                
                # metrics-server add-on required
                hpa:
                  enabled: false
                  maxReplicas: 10
                  # average total CPU usage per pod (1-100)
                  cpu:
                  # average memory usage per pod (100Mi-1Gi)
                  memory:
                  # average http requests per second per pod (k8s-prometheus-adapter)
                  requests:
                
                # Redis address in the format tcp://<host>:<port>
                cache: ""
                # Redis deployment
                redis:
                  enabled: false
                  repository: redis
                  tag: 6.0.8
                
                serviceAccount:
                  # Specifies whether a service account should be created
                  enabled: false
                  # The name of the service account to use.
                  # If not set and create is true, a name is generated using the fullname template
                  name:
                
                # set container security context
                securityContext: {}
                
                ingress:
                  enabled: true
                  className: "nginx"
                  annotations: {}
                  # annotations:
                    # kubernetes.io/ingress.class: nginx
                    # kubernetes.io/tls-acme: "true"
                  hosts:
                    - host: podinfo.amaraldavi.com.br
                      paths:
                        - path: /
                          pathType: Prefix
                  # tls: []
                  tls:
                   - secretName: podinfo-tls
                     hosts:
                       - podinfo.amaraldavi.com.br
                
                linkerd:
                  profile:
                    enabled: false
                
                # create Prometheus Operator monitor
                serviceMonitor:
                  enabled: false
                  interval: 15s
                  additionalLabels:
                    release: prometheus
                
                resources:
                  limits:
                  requests:
                    cpu: 1m
                    memory: 16Mi
                
                nodeSelector: {}
                
                tolerations: []
                
                affinity: {}
                
                podAnnotations:
                  'consul.hashicorp.com/connect-inject': 'true'
                  'consul.hashicorp.com/connect-service-upstream': 'podinfo:9898'
                
                
                
            EOT,
        ]
      + verify                     = false
      + version                    = "6.1.4"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d podinfo`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.amaraldavi.com.br/lock?id=amaraldavi1%252Fpodinfo%252Fpodinfo%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d podinfo`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
